ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_CreateEventCodes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateEventCodesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:EventCodes>
            <v91:EventCode>
               <v91:Code/>
               <v91:Description/>
               <v91:BlackOut/>
               <v91:SellSequence/>
               <v91:Inactive/>
               <v91:HotelCode/>
            </v91:EventCode>
         </v9:EventCodes>
      </v9:CreateEventCodesRQ>
   </soapenv:Body>
</soapenv:Envelope>